Documents/ВыпискаБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыпискаБанка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоступлениеДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеПлатежа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыпискаБанка/Ext/ManagerModule.bsl
Процедура ВыпискаБанка(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ВыпискаБанка)
	Макет = Документы.ВыпискаБанка.ПолучитьМакет("ВыпискаБанка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпискаБанка.Дата,
	|	ВыпискаБанка.Комментарий,
	|	ВыпискаБанка.Номер,
	|	ВыпискаБанка.ПоступлениеДС.(
	|		НомерСтроки,
	|		Контрагент,
	|		Договор,
	|		Сумма,
	|		НазначениеПлатежа
	|	),
	|	ВыпискаБанка.СписаниеДС.(
	|		НомерСтроки,
	|		Контрагент,
	|		Договор,
	|		Сумма,
	|		НазначениеПлатежа
	|	)
	|ИЗ
	|	Документ.ВыпискаБанка КАК ВыпискаБанка
	|ГДЕ
	|	ВыпискаБанка.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоступлениеДСШапка = Макет.ПолучитьОбласть("ПоступлениеДСШапка");
	ОбластьПоступлениеДС = Макет.ПолучитьОбласть("ПоступлениеДС");
	ОбластьСписаниеДСШапка = Макет.ПолучитьОбласть("СписаниеДСШапка");
	ОбластьСписаниеДС = Макет.ПолучитьОбласть("СписаниеДС");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоступлениеДСШапка);
		ВыборкаПоступлениеДС = Выборка.ПоступлениеДС.Выбрать();
		Пока ВыборкаПоступлениеДС.Следующий() Цикл
			ОбластьПоступлениеДС.Параметры.Заполнить(ВыборкаПоступлениеДС);
			ТабДок.Вывести(ОбластьПоступлениеДС, ВыборкаПоступлениеДС.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСписаниеДСШапка);
		ВыборкаСписаниеДС = Выборка.СписаниеДС.Выбрать();
		Пока ВыборкаСписаниеДС.Следующий() Цикл
			ОбластьСписаниеДС.Параметры.Заполнить(ВыборкаСписаниеДС);
			ТабДок.Вывести(ОбластьСписаниеДС, ВыборкаСписаниеДС.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
